constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
nu0              nu0 [ 0 2 -1 0 0 0 0 ] 9.45; //viscosity of suspended Liquid
cm               cm [ 0 0 0 0 0 0 0 ] 0.68;
alpha            alpha [ 0 0 0 0 0 0 0 ] 4;
a		a [ 0 1 0 0 0 0 0 ] 34e-5; //a = Raadius of solid particles
epsilon		epsilon [ 0 -1 0 0 0 0 0 ] 61.7284; //epsilon=a/(H/2)² in case of channel flows, where here H=gap width
// ************************************************************************* //
