0/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {

       type             fixedValue;
       value            (0 0 1);


//       type             rotatingWallVelocity;
//       origin           (0 0 0);
 //      axis              (0 0 1);
  //     omega            6.28;

//    type slip;
    }
   

    outlet
    {
        type zeroGradient;
    }

    sides
    {
        type            noSlip;
    }
    
}

// ************************************************************************* //
