0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 1e5;

boundaryField
{
    inlet
    {
        type               zeroGradient;
        value              $internalField;
    }

    sides
    {
        type               zeroGradient;
        value              $internalField;
    }

    outlet
    {
        type fixedFluxPressure;
    }

  //  "front|back"
   // {
     //   type            wedge;
   // }

}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
